---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimWitnsLineExtensionBelow
source: html/e02f0011-032d-6c63-f75c-1689cceeeba3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimWitnsLineExtensionBelow Property

"Witness Line Length"

## Syntax (C#)
```csharp
public static ForgeTypeId DimWitnsLineExtensionBelow { get; }
```